var countriesArray = [{"iso":"AT","name":"Austria","continent":"EU","capital":{"cityName":"Vienna","cityCode":2782113},"details":{"area":83858,"population":8205000,"domain":".at","currencyCode":"EUR","currency":"Euro","phone":43,"languages":"de-AT,hr,hu,sl","neighbours":"CH,DE,HU,SK,CZ,IT,SI,LI"},"description":"Austria, officially the Republic of Austria, is a country in Central Europe comprising nine federated states. Its capital, largest city and one of nine states is Vienna. Austria has an area of 83,879 km2 (32,386 sq mi), a population of nearly nine million people and a nominal GDP of $477 billion. It is bordered by the Czech Republic and Germany to the north, Hungary and Slovakia to the east, Slovenia and Italy to the south, and Switzerland and Liechtenstein to the west. The terrain is landlocked and highly mountainous, lying within the Alps; only 32% of the country is below 500 m (1,640 ft), and its highest point is 3,798 m (12,461 ft). The majority of the population speaks local Bavarian dialects as their native language, and German in its standard form is the country's official language. Other regional languages are Hungarian, Burgenland Croatian, and Slovene."},{"iso":"BS","name":"Bahamas","continent":"NA","capital":{"cityName":"Nassau","cityCode":3572887},"details":{"area":13940,"population":301790,"domain":".bs","currencyCode":"BSD","currency":"Dollar","phone":"+1-242","languages":"en-BS","neighbours":""},"description":"The Bahamas, officially the Commonwealth of the Bahamas, is a country consisting of more than 3,000 islands, cays and islets in the Atlantic Ocean, north of Cuba and Hispaniola (the Dominican Republic and Haiti), northwest of the Turks and Caicos Islands and southeast of the US state of Florida. Its capital is Nassau on the island of New Providence. Geographically, the Bahamas lie in the same island chain as Cuba, Hispaniola and the Turks and Caicos Islands; the designation of \"Bahamas\" usually refers to the country and not the geographic chain. The country's population, numbering around 354,000, lives on a land area of 13,939 km2 (5,382 sq mi)."},{"iso":"CA","name":"Canada","continent":"NA","capital":{"cityName":"Ottawa","cityCode":6251999},"details":{"area":9984670,"population":33679000,"domain":".ca","currencyCode":"CAD","currency":"Dollar","phone":1,"languages":"en-CA,fr-CA,iu","neighbours":"US"},"description":"Canada is a North American country consisting of ten provinces and three territories. Located in the northern part of the continent, it extends from the Atlantic to the Pacific and northward into the Arctic Ocean. Canada is the world's second-largest country by total area, and its common border with the United States is the world's longest land border."},{"iso":"EG","name":"Egypt","continent":"AF","capital":{"cityName":"Cairo","cityCode":357994},"details":{"area":1001450,"population":80471869,"domain":".eg","currencyCode":"EGP","currency":"Pound","phone":20,"languages":"ar-EG,en,fr","neighbours":"LY,SD,IL"},"description":"Egypt, officially the Arab Republic of Egypt, is a country in the northeast corner of Africa, whose territory in the Sinai Peninsula extends beyond the continental boundary with Asia, as traditionally defined. Egypt is bordered by the Gaza Strip and Israel to the northeast, the Gulf of Aqaba and the Red Sea to the east, Sudan to the south, Libya to the west, and the Mediterranean Sea to the north. Across the Gulf of Aqaba lies Jordan, across the Red Sea lies Saudi Arabia, and across the Mediterranean lie Greece, Turkey and Cyprus, although none share a land border with Egypt."},{"iso":"FR","name":"France","continent":"EU","capital":{"cityName":"Paris","cityCode":3017382},"details":{"area":547030,"population":64768389,"domain":".fr","currencyCode":"EUR","currency":"Euro","phone":33,"languages":"fr-FR,frp,br,co,ca,eu,oc","neighbours":"CH,DE,BE,LU,IT,AD,MC,ES"},"description":"France is a unitary semi-presidential republic in Western Europe with several overseas territories and islands. Metropolitan France extends from the Mediterranean Sea to the English Channel and the North Sea, and from the Rhine to the Atlantic Ocean. It is often referred to as l'Hexagone (\"The Hexagon\") because of the geometric shape of its territory."},{"iso":"DE","name":"Germany","continent":"EU","capital":{"cityName":"Berlin","cityCode":2921044},"details":{"area":357021,"population":81802257,"domain":".de","currencyCode":"EUR","currency":"Euro","phone":49,"languages":"de","neighbours":"CH,PL,NL,DK,BE,CZ,LU,FR,AT"},"description":"Germany is a federal parliamentary republic in west-central Europe. The country consists of 16 states, and its capital and largest city is Berlin. Germany covers an area of 357,021 square kilometres (137,847 sq mi) and has a largely temperate seasonal climate. With 81.8 million inhabitants, it is the most populous member state in the European Union. Germany is one of the major political and economic powers of the European continent and a historic leader in many theoretical and technical fields."},{"iso":"GH","name":"Ghana","continent":"AF","capital":{"cityName":"Accra","cityCode":2300660},"details":{"area":239460,"population":24339838,"domain":".gh","currencyCode":"GHS","currency":"Cedi","phone":233,"languages":"en-GH,ak,ee,tw","neighbours":"CI,TG,BF"},"description":"Ghana is a country in West Africa. It is bordered by Cote d'Ivoire (Ivory Coast) to the west, Burkina Faso to the north, Togo to the east, and the Gulf of Guinea to the south. The word Ghana means \"Warrior King\" and is derived from the ancient Ghana Empire."},{"iso":"GR","name":"Greece","continent":"EU","capital":{"cityName":"Athens","cityCode":390903},"details":{"area":131940,"population":11000000,"domain":".gr","currencyCode":"EUR","currency":"Euro","phone":30,"languages":"el-GR,en,fr","neighbours":"AL,MK,TR,BG"},"description":"Greece, officially the Hellenic Republic, is a country located in Southeast Europe. Its population is approximately 10.7 million as of 2018; Athens is the nation's capital and largest city, followed by Thessaloniki."},{"iso":"HU","name":"Hungary","continent":"EU","capital":{"cityName":"Budapest","cityCode":719819},"details":{"area":93030,"population":9930000,"domain":".hu","currencyCode":"HUF","currency":"Forint","phone":36,"languages":"hu-HU","neighbours":"SK,SI,RO,UA,CS,HR,AT,RS"},"description":"Hungary is a country in Central Europe. Spanning 93,030 square kilometres (35,920 sq mi) in the Carpathian Basin, it borders Slovakia to the north, Ukraine to the northeast, Austria to the northwest, Romania to the east, Serbia to the south, Croatia to the southwest, and Slovenia to the west. With about 10 million inhabitants, Hungary is a medium-sized member state of the European Union. The official language is Hungarian, which is the most widely spoken Uralic language in the world, and among the few non-Indo-European languages to be widely spoken in Europe. Hungary's capital and largest city is Budapest; other major urban areas include Debrecen, Szeged, Miskolc, Pecs and Gyor."},{"iso":"IS","name":"Iceland","continent":"EU","capital":{"cityName":"Reykjavik","cityCode":2629691},"details":{"area":103000,"population":308910,"domain":".is","currencyCode":"ISK","currency":"Krona","phone":354,"languages":"is,en,de,da,sv,no","neighbours":""},"description":"The Republic of Iceland is a Nordic island country in the North Atlantic Ocean. It has a population of 332,529 and an area of 103,000 km2 (40,000 sq mi), making it the most sparsely populated country in Europe. The capital and largest city is Reykjavik. Reykjavik and the surrounding areas in the southwest of the country are home to over two-thirds of the population. Iceland is volcanically and geologically active. The interior consists of a plateau characterised by sand and lava fields, mountains and glaciers, while many glacial rivers flow to the sea through the lowlands. Iceland is warmed by the Gulf Stream and has a temperate climate, despite a high latitude just outside the Arctic Circle. Its high latitude and marine influence still keeps summers chilly, with most of the archipelago having a tundra climate."},{"iso":"IN","name":"India","continent":"AS","capital":{"cityName":"New Delhi","cityCode":1269750},"details":{"area":3287590,"population":1173108018,"domain":".in","currencyCode":"INR","currency":"Rupee","phone":91,"languages":"en-IN,hi,bn,te,mr,ta,ur,gu,kn,ml,or,pa,as,bh,sat,ks,ne,sd,kok,doi,mni,sit,sa,fr,lus,inc","neighbours":"CN,NP,MM,BT,PK,BD"},"description":"India is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia."},{"iso":"IT","name":"Italy","continent":"EU","capital":{"cityName":"Rome","cityCode":3175395},"details":{"area":301230,"population":60340328,"domain":".it","currencyCode":"EUR","currency":"Euro","phone":39,"languages":"it-IT,de-IT,fr-IT,sc,ca,co,sl","neighbours":"CH,VA,SI,SM,FR,AT"},"description":"Italy is a unitary parliamentary republic in Southern Europe. To the north, it borders France, Switzerland, Austria, and Slovenia along the Alps. To the south, it consists of the entirety of the Italian Peninsula, Sicily, Sardinia and many other smaller islands. The independent states of San Marino and the Vatican City are enclaves within Italy, while Campione d'Italia is an Italian exclave in Switzerland. The territory of Italy covers some 301,338 km2 (116,347 sq mi) and is influenced by a temperate seasonal climate. With 60.8 million inhabitants, it is the fifth most populous country in Europe, and the 23rd most populous in the world."},{"iso":"LA","name":"Laos","continent":"AS","capital":{"cityName":"Vientiane","cityCode":1655842},"details":{"area":236800,"population":6368162,"domain":".la","currencyCode":"LAK","currency":"Kip","phone":856,"languages":"lo,fr,en","neighbours":"CN,MM,KH,TH,VN"},"description":"Laos, officially the Lao People's Democratic Republic, or commonly referred to its colloquial name of Muang Lao is a landlocked country in the heart of the Indochinese peninsula of Mainland Southeast Asia, bordered by Myanmar (Burma) and China to the northwest, Vietnam to the east, Cambodia to the south, and Thailand to the west."},{"iso":"NP","name":"Nepal","continent":"AS","capital":{"cityName":"Kathmandu","cityCode":1282988},"details":{"area":140800,"population":28951852,"domain":".np","currencyCode":"NPR","currency":"Rupee","phone":977,"languages":"ne,en","neighbours":"CN,IN"},"description":"Nepal, officially the Federal Democratic Republic of Nepal,is a landlocked country in South Asia with a population of 26.4 million. It is a multiethnic nation with Nepali as the official language. Kathmandu is the nation's capital and largest city. Modern Nepal is a secular parliamentary republic."},{"iso":"NL","name":"Netherlands","continent":"EU","capital":{"cityName":"Amsterdam","cityCode":2750405},"details":{"area":41526,"population":16645000,"domain":".nl","currencyCode":"EUR","currency":"Euro","phone":31,"languages":"nl-NL,fy-NL","neighbours":"DE,BE"},"description":"The Netherlands is a small, densely populated country located in Western Europe with three island territories in the Caribbean. The European part of the Netherlands borders Germany to the east, Belgium to the south, and the North Sea to the northwest, sharing maritime borders with Belgium, the United Kingdom, and Germany. The largest cities in the Netherlands are Amsterdam, The Hague and Rotterdam. Amsterdam is the country's capital, while The Hague holds the Dutch seat of government and parliament. The port of Rotterdam is the largest port in Europe and was the world's largest port between 1962 and 2004. The name Holland is also frequently and incorrectly used to refer informally to the whole of the country of the Netherlands."},{"iso":"PE","name":"Peru","continent":"SA","capital":{"cityName":"Lima","cityCode":3932488},"details":{"area":1285220,"population":29907003,"domain":".pe","currencyCode":"PEN","currency":"Sol","phone":51,"languages":"es-PE,qu,ay","neighbours":"EC,CL,BO,BR,CO"},"description":"Peru, officially the Republic of Peru, is a country in western South America. It is bordered in the north by Ecuador and Colombia, in the east by Brazil, in the southeast by Bolivia, in the south by Chile, and in the west by the Pacific Ocean. Peru is an extremely biodiverse country with habitats ranging from the arid plains of the Pacific coastal region in the west to the peaks of the Andes mountains vertically extending from the north to the southeast of the country to the tropical Amazon Basin rainforest in the east with the Amazon river."},{"iso":"SI","name":"Slovenia","continent":"EU","capital":{"cityName":"Ljubljana","cityCode":3190538},"details":{"area":20273,"population":2007000,"domain":".si","currencyCode":"EUR","currency":"Euro","phone":386,"languages":"sl,sh","neighbours":"HU,IT,HR,AT"},"description":"Slovenia, officially the Republic of Slovenia, is a nation state in southern Central Europe, located at the crossroads of main European cultural and trade routes. It is bordered by Italy to the west, Austria to the north, Hungary to the northeast, Croatia to the south and southeast, and the Adriatic Sea to the southwest. It covers 20,273 square kilometers (7,827 sq mi) and has a population of 2.06 million. It is a parliamentary republic and a member of the United Nations, European Union, and NATO. The capital and largest city is Ljubljana."},{"iso":"ES","name":"Spain","continent":"EU","capital":{"cityName":"Madrid","cityCode":2510769},"details":{"area":504782,"population":46505963,"domain":".es","currencyCode":"EUR","currency":"Euro","phone":34,"languages":"es-ES,ca,gl,eu,oc","neighbours":"AD,PT,GI,FR,MA"},"description":"Spain is a sovereign state and a member of the European Union located in southwestern Europe on the Iberian Peninsula. Its mainland is bordered to the south and east by the Mediterranean Sea except for a small land boundary with the British Overseas Territory of Gibraltar, to which Spain lays claim; to the north and north east by France, Andorra, and the Bay of Biscay; and to the northwest and west by the Atlantic Ocean and Portugal."},{"iso":"TH","name":"Thailand","continent":"AS","capital":{"cityName":"Bangkok","cityCode":1605651},"details":{"area":514000,"population":67089500,"domain":".th","currencyCode":"THB","currency":"Baht","phone":66,"languages":"th,en","neighbours":"LA,MM,KH,MY"},"description":"Thailand, officially the Kingdom of Thailand, formerly known as Siam, is a country at the centre of the Indochinese peninsula in Southeast Asia. With a total area of approximately 513,000 km2 (198,000 sq mi), Thailand is the world's 51st-largest country. It is the 20th-most-populous country in the world, with around 66 million people. The capital and largest city is Bangkok."},{"iso":"GB","name":"United Kingdom","continent":"EU","capital":{"cityName":"London","cityCode":2635167},"details":{"area":244820,"population":62348447,"domain":".uk","currencyCode":"GBP","currency":"Pound","phone":44,"languages":"en-GB,cy-GB,gd","neighbours":"IE"},"description":"The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom (UK) or Britain, is a sovereign state located off the north-western coast of continental Europe. The country includes the island of Great Britain, the north-eastern part of the island of Ireland, and many smaller islands. Northern Ireland is the only part of the UK that shares a land border with another sovereign state. Apart from this land border the UK is surrounded by the Atlantic Ocean, the North Sea, the English Channel and the Irish Sea."},{"iso":"US","name":"United States","continent":"NA","capital":{"cityName":"Washington","cityCode":6252001},"details":{"area":9629091,"population":310232863,"domain":".us","currencyCode":"USD","currency":"Dollar","phone":1,"languages":"en-US,es-US,haw,fr","neighbours":"CA,MX,CU"},"description":"The United States of America (commonly called the United States, the U.S., the USA, America, and the States) is a federal constitutional republic consisting of fifty states and a federal district. The country is situated mostly in central North America, where its forty-eight contiguous states and Washington, D.C., the capital district, lie between the Pacific and Atlantic Oceans, bordered by Canada to the north and Mexico to the south. The state of Alaska is in the northwest of the continent, with Canada to the east and Russia to the west across the Bering Strait. The state of Hawaii is an archipelago in the mid-Pacific. The country also possesses several territories in the Pacific and Caribbean. At 3.79 million square miles (9.83 million km2) and with over 314 million people, the United States is the third- or fourth-largest country by total area, and the third-largest by both land area and population. It is one of the world's most ethnically diverse and multicultural nations, the product of large-scale immigration from many countries."}];